{
"COMP_RES_1000" = "Widget Library";
"COMP_RES_2000" = "oDateTime";
"COMP_RES_2001" = "oCountButton";
"COMP_RES_2002" = "oDataList";
"COMP_RES_2003" = "oDropDown";
"COMP_RES_2004" = "oImage";
"COMP_RES_2005" = "oFontDropDown";
"COMP_RES_2006" = "oRoundedButton";
"COMP_RES_4000" = "$localtime:our datetime in the local timezone";
"COMP_RES_4001" = "$utc:our datetime as UTC";
"COMP_RES_4100" = "$counter:counter to display";
"COMP_RES_4101" = "$radius:radius";
"COMP_RES_4102" = "$spacing:spacing";
"COMP_RES_4103" = "$countColor:Background color of our counter";
"COMP_RES_4104" = "$fillColor:Fill color for our button";
"COMP_RES_4105" = "$iconPos:0 = left, 1 = right";
"COMP_RES_4110" = "$columncount:Number of columns we display";
"COMP_RES_4111" = "$columncalcs:Our column calculations, tab delimited";
"COMP_RES_4112" = "$columnwidths:Our columns widths";
"COMP_RES_4113" = "$columnaligns:Our column alignment";
"COMP_RES_4114" = "$maxrowheight:Maximum row height";
"COMP_RES_4115" = "$columnPrefix:This calculation gets added to every line";
"COMP_RES_4116" = "$verticalExtends:Limits which columns wrapping text will increase the row height";
"COMP_RES_4117" = "$evenColor:Alternative background color for even lines (default color = ignore)";
"COMP_RES_4118" = "$selectColor:Background color for selected lines (default color = use system)";
"COMP_RES_4120" = "$groupcalcs:calculations by which we group";
"COMP_RES_4121" = "$treeIndent:Number of pixels we indent our nodes in our treelist with";
"COMP_RES_4122" = "$filtercalc:calculation by which to filter which lines we show";
"COMP_RES_4123" = "$deselectOnGroupClick:Deselect lines when we click on a node";
"COMP_RES_4124" = "$parentCalcs:calculations that identify a group as a parent group";
"COMP_RES_4200" = "$displaycalc:If set, alternative display calculation";
"COMP_RES_4201" = "$fontColumn:Column number containing our font name";
"COMP_RES_4300" = "$layercount:Number of layers";
"COMP_RES_4301" = "$currentLayer:Layer we have selected";
"COMP_RES_4302" = "$layertype:Type of layer";
"COMP_RES_4303" = "$layerleft:Left of layer";
"COMP_RES_4304" = "$layertop:Top of layer";
"COMP_RES_4305" = "$layerwidth:Width of layer";
"COMP_RES_4306" = "$layerheight:Height of layer";
"COMP_RES_4307" = "$layercontents:Contents of the layer";
"COMP_RES_4308" = "$layerenabled:Layer is enabled";
"COMP_RES_4309" = "$image:Our image";
"COMP_RES_4310" = "$imageWidth:Width of our image (0 = use layer 1)";
"COMP_RES_4311" = "$imageHeight:Height of our image (0 = use layer 1)";
"COMP_RES_5000" = "click:User clicked on our field";
"COMP_RES_5001" = "HScrolled:Field was horizontally scrolled";
"COMP_RES_5002" = "VScrolled:Field was vertically scrolled";
"COMP_RES_5003" = "ColumnResized:Column was resized";
"COMP_RES_5004" = "DoubleClick:User double clicked on our field";
"COMP_RES_7000" = "seconds:Seconds";
"COMP_RES_7001" = "lineNo:Line number";
"COMP_RES_7002" = "X:X-coord";
"COMP_RES_7003" = "Y:Y-coord";
"COMP_RES_7100" = "layer:Layer";
"COMP_RES_8000" = "$addSeconds:$addSeconds() Add seconds to datetime.";
"COMP_RES_8010" = "$isvisible:$isVisible(pvLineNo) Is line visible?";
"COMP_RES_8011" = "$lineAtPos:$lineAtPos(pvY) which line is at this Y coord";
"COMP_RES_8012" = "$lineAtMouse:$lineAtMouse() which line is below the mouse";
"COMP_RES_8100" = "$addLayer:$addLayer() add a layer to our image.";
"COMP_RES_8101" = "$remLayer:$remLayer(pLayer) removes a layer from our image";
"COMP_RES_9000" = "$monitors:$monitors() returns detailed info about connected monitors";
"COMP_RES_10000" = "on evClick ;; Button has been clicked";
"COMP_RES_10001" = "Quit event handler (Pass to next handler)";
"COMP_RES_10002" = " ";
"COMP_RES_10010" = "on evClick ;; line (pLineNo) has been clicked";
"COMP_RES_10011" = "Quit event handler (Pass to next handler)";
"COMP_RES_10012" = " ";
"COMP_RES_10020" = "on evClick ;; Line has been clicked";
"COMP_RES_10021" = "Quit event handler (Pass to next handler)";
"COMP_RES_10022" = " ";
"COMP_RES_31000" = "FrameworkWndProc";
}
